trovi artifact generate \
--name "Reproducing Gradient-GA for Sample-Efficient Molecular Optimization" \
--short-description "Reproduced code, experimental results, and analysis for Gradient-GA under GuacaMol objectives" \
--description "## Overview

This artifact reproduces the main experiments from the paper **Gradient-Guided Genetic Algorithms for Sample-Efficient Molecular Optimization**.

We reimplemented and executed the molecular optimization pipelines to evaluate Gradient-GA and multiple baseline methods under a fixed oracle-call budget, following the original experimental protocol.

**Included in this artifact:**
* **Reproduced Code:** Full codebase used to run Gradient-GA and baseline methods.
* **Experimental Results:** Raw YAML outputs and aggregated statistics from our runs.
* **Analysis Scripts:** Scripts to compute AUC Top-1, Top-10, Top-100 and generate plots, heatmaps, and tables.
* **Original Paper:** *Gradient-Guided Genetic Algorithms for Sample-Efficient Molecular Optimization*.

## Reproduction Goal

To validate the main claim of the paper that **incorporating gradient information accelerates convergence** in molecular optimization, measured by AUC-based metrics under a strict oracle-call budget.

## Experimental Setup

* **Oracle Budget:** 2500 oracle calls
* **Runs:** 5 random seeds per method
* **Primary Objective:** Mestranol Similarity
* **Additional Objectives:** Amlodipine MPO, Perindopril MPO, DecoHop, Median1, Isomers (C9H10N2O2PF2Cl)
* **Methods Evaluated:**
  - Gradient GA
  - Graph GA
  - SMILES GA
  - MARS
  - MIMOSA
  - DST

## Experimental Results and Analysis

### Figure 3: Mestranol Similarity – AUC Top-10 vs Oracle Calls
This figure compares AUC Top-10 scores as the number of oracle calls increases. AUC Top-10 measures how quickly each method discovers high-quality molecules.

Our results show that **Gradient-GA consistently achieves higher AUC Top-10 values with fewer oracle calls**, indicating superior sample efficiency and faster convergence compared to baseline methods.

### Figure 4: Mestranol Similarity – AUC Top-100 vs Oracle Calls
AUC Top-100 evaluates the overall quality of the molecular population throughout optimization.

Gradient-GA maintains higher AUC Top-100 scores across the oracle-call budget, demonstrating not only rapid discovery of top candidates but also sustained population-level performance.

### Figure 5: Synthetic Accessibility (SA) Heatmap
This heatmap compares the synthetic accessibility (SA) scores of molecules generated by different methods across multiple objectives. Lower SA scores indicate molecules that are easier to synthesize.

Gradient-GA produces molecules with **consistently lower SA scores**, showing that performance gains do not come at the cost of chemical realism.

### Figure 6: Diversity Heatmap
The diversity heatmap measures structural diversity among generated molecules, where higher values indicate better exploration.

Gradient-GA preserves higher diversity compared to baseline methods, suggesting that gradient guidance improves optimization without causing mode collapse or reduced exploration.

Overall, these results closely match the trends reported in the original paper and confirm that gradient-guided genetic algorithms improve **sample efficiency, solution quality, and robustness** in molecular optimization.

## Metrics Reported

* Average Top-10 Score
* AUC Top-1
* AUC Top-10
* AUC Top-100

All AUC metrics are computed using the same trapezoidal integration scheme as the original implementation.

## Environment and Notes

* Python 3.9+
* PyTorch, NumPy, RDKit, TDC
* Experiments executed with fixed random seeds
* Minor modifications were made to ensure reproducibility and consistent logging
" \
--tag "reproducible research" `
--author "Nandini Putri Hanifa Jannah:nandiniputri7704@gmail.com:Universitas Jember"
